In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('/Users/delinaivanova/Library/CloudStorage/OneDrive-Personal/UoT/Micro Courses/Data Science/3250 B/Module 1/MessyData.csv')

In [3]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,30-Jan-87,77569.0,500,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,05-Sep-91,117630.0,5000,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,02-May-52,NaN,3000,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,31-Oct-81,97911.0,4000,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,25-Jul-01,NaN,high,NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           30 non-null     object
 1   PhoneNumber    30 non-null     object
 2   City           30 non-null     object
 3   Address        30 non-null     object
 4   PostalCode     30 non-null     object
 5   BirthDate      30 non-null     object
 6   Income         26 non-null     float64
 7   CreditLimit    30 non-null     object
 8   MaritalStatus  24 non-null     object
dtypes: float64(1), object(8)
memory usage: 2.2+ KB

In [5]:
# count total number of missing values
df.isnull().sum().sum()

10

In [6]:
df.shape

(30, 9)

In [7]:
# calculate total number of data points in data frame
df.shape[0] * df.shape[1]

270

In [8]:
# calculate % of missing values

df.isnull().sum().sum() / (df.shape[0]*df.shape[1])

0.037037037037037035

In [9]:
# calculate % of missing data by column
df.isnull().sum() / df.shape[0]

Name             0.000000
PhoneNumber      0.000000
City             0.000000
Address          0.000000
PostalCode       0.000000
BirthDate        0.000000
Income           0.133333
CreditLimit      0.000000
MaritalStatus    0.200000
dtype: float64

In [10]:
# we can check quickly what would happen if we drop all data - we see we would be left with only 21 observations
df.dropna().info()

<class 'pandas.core.frame.DataFrame'>
Index: 21 entries, 0 to 28
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           21 non-null     object
 1   PhoneNumber    21 non-null     object
 2   City           21 non-null     object
 3   Address        21 non-null     object
 4   PostalCode     21 non-null     object
 5   BirthDate      21 non-null     object
 6   Income         21 non-null     float64
 7   CreditLimit    21 non-null     object
 8   MaritalStatus  21 non-null     object
dtypes: float64(1), object(8)
memory usage: 1.6+ KB

In [11]:
df['CreditLimit'] = pd.to_numeric(df['CreditLimit'], errors='coerce')

In [12]:
# find values with text only
df2 = pd.read_csv('/Users/delinaivanova/Library/CloudStorage/OneDrive-Personal/UoT/Micro Courses/Data Science/3250 B/Module 1/MessyData.csv')
text_only = df2[df2['CreditLimit'].str.isalpha()]

In [13]:
text_only

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,25-Jul-01,NaN,high,NaN

In [14]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,30-Jan-87,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,05-Sep-91,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,02-May-52,NaN,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,31-Oct-81,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,25-Jul-01,NaN,NaN,NaN

In [15]:
df['CreditLimit'].replace('high',5000)

0      500.0
1     5000.0
2     3000.0
3     4000.0
4        NaN
5     4500.0
6     5000.0
7      500.0
8     3500.0
9     3000.0
10    1000.0
11    4000.0
12    2500.0
13    3000.0
14    1000.0
15    2500.0
16    3000.0
17    3800.0
18    4000.0
19    3000.0
20    4500.0
21    4500.0
22    3500.0
23     500.0
24    3500.0
25    3000.0
26    1000.0
27    3800.0
28    2500.0
29    5000.0
Name: CreditLimit, dtype: float64

In [16]:
# fixing the datetime data type

df['BirthDate'] = pd.to_datetime(df['BirthDate'])

/var/folders/75/tr_v06ms4k7gy38vcppxbcf80000gn/T/ipykernel_98233/1139435587.py:3: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['BirthDate'] = pd.to_datetime(df['BirthDate'])

In [17]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,2052-05-02,NaN,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,NaN,NaN,NaN

In [18]:
import datetime

In [19]:
datetime.datetime.today().year

2023

In [20]:
def fix_birthdate(x):
    if x.year > datetime.datetime.today().year:
        year = x.year - 100
    else:
        year = x.year

    return datetime.date(year, x.month, x.day)

In [21]:
df['BirthDate'] = df['BirthDate'].apply(fix_birthdate)

In [22]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,NaN,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,NaN,NaN,NaN

In [23]:
# check for spellings in the City column
df['City'].unique()

array(['Yellowknife', 'Ottawa', 'Winnipeg', 'Charlottetown',
       'Charlotttetownn', 'Toronto', 'Winnipegg', 'Ottawas', 'Toronot'],
      dtype=object)

In [24]:
# check for spellings in the marital status column
df['MaritalStatus'].unique()

array(['Single', 'Divorced', 'Married', nan], dtype=object)

In [25]:
# replace misspelling directly
df['City'] = df['City'].replace('Charlotttetownn','Charlottetown')

In [26]:
# OR map misspellings to a correct spelling
corrections_dict = {'Yellowknife':'Yellowknife', 
                    'Ottawa':'Ottawa', 
                    'Winnipeg':'Winnipeg', 
                    'Charlottetown':'Charlottetown',
                    'Charlotttetownn':'Charlottetown', 
                    'Toronto':'Toronto', 
                    'Winnipegg':'Winnipeg', 
                    'Ottawas':'Ottawa', 
                    'Toronot':'Toronto'}

In [27]:
df['City'] = df['City'].map(corrections_dict)

In [28]:
df['City'].unique()

array(['Yellowknife', 'Ottawa', 'Winnipeg', 'Charlottetown', 'Toronto'],
      dtype=object)

In [29]:
# Missing Data
df.groupby('MaritalStatus').count()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit
MaritalStatus,,,,,,,,
Divorced,7,7,7,7,7,7,5,7
Married,9,9,9,9,9,9,8,9
Single,8,8,8,8,8,8,8,8

In [30]:
# fill in with a constant
df['MaritalStatus'] = df['MaritalStatus'].fillna('Unknown')

In [31]:
# fill in with aggregate value for a single column
df['CreditLimit'] = df['CreditLimit'].fillna(df['CreditLimit'].median())

In [32]:
# for a more complex application, we could use groupby
df.groupby('City')['Income'].median()

City
Charlottetown    122042.0
Ottawa            75545.0
Toronto           75039.0
Winnipeg          79284.5
Yellowknife      122699.0
Name: Income, dtype: float64

In [33]:
df['Income'].median()

107770.5

In [34]:
df['Income'] = df['Income'].fillna(df.groupby('City')['Income'].transform('median'))

In [35]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,75545.0,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,122042.0,3000.0,Unknown

In [36]:
df2['CreditLimit'] = pd.to_numeric(df2['CreditLimit'], errors='coerce')

In [37]:
df2.describe()

              Income  CreditLimit
count      26.000000    29.000000
mean   104742.461538  3055.172414
std     52935.742490  1403.970443
min     18475.000000   500.000000
25%     66131.250000  2500.000000
50%    107770.500000  3000.000000
75%    146980.750000  4000.000000
max    256360.000000  5000.000000

In [38]:
df2.dropna().describe()

              Income  CreditLimit
count      21.000000    21.000000
mean   106222.238095  3147.619048
std     56543.729211  1415.492511
min     18475.000000   500.000000
25%     60658.000000  2500.000000
50%    117630.000000  3500.000000
75%    147312.000000  4000.000000
max    256360.000000  5000.000000

In [39]:
df.describe()

              Income  CreditLimit
count      30.000000    30.000000
mean   103932.400000  3053.333333
std     49954.624336  1379.588478
min     18475.000000   500.000000
25%     69548.500000  2500.000000
50%    107770.500000  3000.000000
75%    141432.250000  4000.000000
max    256360.000000  5000.000000

In [40]:
df2.describe()

              Income  CreditLimit
count      26.000000    29.000000
mean   104742.461538  3055.172414
std     52935.742490  1403.970443
min     18475.000000   500.000000
25%     66131.250000  2500.000000
50%    107770.500000  3000.000000
75%    146980.750000  4000.000000
max    256360.000000  5000.000000

In [41]:
import re

In [43]:
df['PhoneNumber'].unique()

array(['8675550155', '867-555-0148', '613-555-0111', '204-555-0105',
       '902555-0157', '902-555-0177', '204-555-0136', '416-555-0159',
       '204-555-0189', '902-555-0108', '416-5550167', '902-555-0195',
       '204-555-0195', '204-555-0180', '613-555-0154', '613-555-0150',
       '416-5550180', '867-555-0113', '416-555-0192', '902-555-0190',
       '4165550170', '204-555-0190', '902-555-0138', '613-555-0116',
       '613-555-0165', '867-555-0158', '867-555-0161', '416-555-0198',
       '867-555-0134', '613-555-0139'], dtype=object)

In [44]:
pattern1 = re.compile(r'(\d{3})-(\d{3})-(\d{4})')

In [45]:
print(pattern1.search('852-456-4875'))

<re.Match object; span=(0, 12), match='852-456-4875'>

In [46]:
print(pattern1.search('852456-4875'))

None

In [53]:
def fix_phone(x):
    pattern1 = re.compile(r'(\d{3})-(\d{3})-(\d{4})')
    pattern2 = re.compile(r'(\d{3})-(\d{7})')
    pattern3 = re.compile(r'(\d{6})-(\d{4})')
    pattern4 = re.compile(r'(\d{10})')

    if pattern1.search(x) != None:
        return x
    elif pattern2.search(x) != None:
        return '-'.join([x[:7],x[7:]])
    elif pattern3.search(x) != None:
        return '-'.join([x[:3],x[3:]])
    elif pattern4.search(x) != None:
        return '-'.join([x[:3],x[3:6],x[6:]])
    else:
        return "Pattern not found"

In [50]:
string = '874784-9865'

In [51]:
string[:3]

'874'

In [52]:
string[3:]

'784-9865'

In [54]:
df['PhoneNumber_New'] = df['PhoneNumber'].apply(fix_phone)

In [55]:
df

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus,PhoneNumber_New
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single,867-555-0155
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced,867-555-0148
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,75545.0,3000.0,Married,613-555-0111
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced,204-555-0105
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,122042.0,3000.0,Unknown,902-555-0157
5,Aoibhín Chinyere Léandre,902-555-0177,Charlottetown,7282 E. Redwood Street,C1A1T1,2001-03-24,157027.0,4500.0,Single,902-555-0177
6,Aksel Parent,204-555-0136,Winnipeg,27 Queen Road,R2V1H5,1976-05-19,60658.0,5000.0,Single,204-555-0136
7,Helgi Lessie Castelo,416-555-0159,Toronto,438 E. Cypress Ave.,M5V3N2,1962-03-15,75039.0,500.0,Divorced,416-555-0159
8,Heaven Maximilienne Austin,204-555-0189,Winnipeg,7471 Rockcrest St.,R2G3B5,1976-11-05,152732.0,3500.0,Single,204-555-0189
9,Pippa Stéphane Chevalier,902-555-0108,Charlottetown,692 Thompson Drive,C1C1N8,2003-06-06,125318.0,3000.0,Unknown,902-555-0108
10,Flurry Annikki Ó Ceallacháin,416-5550167,Toronto,8614 Riverside Avenue,M5H0H1,1968-07-25,68145.0,1000.0,Married,416-555-0167
11,Tanzi Liisi Alescio,902-555-0195,Charlottetown,175 E. Dunbar Drive,C1A8H3,1998-07-24,118766.0,4000.0,Married,902-555-0195
12,Sofia Vodenicharov,204-555-0195,Winnipeg,883 High Point Lane,R3T1C3,1974-03-08,120311.0,2500.0,Married,204-555-0195
13,Eldred Sonia Henson,204-555-0180,Winnipeg,832 Oak Meadow Avenue,R3R3B6,1977-06-27,53013.0,3000.0,Married,204-555-0180
14,Donelle Rowland Coghlan,613-555-0154,Ottawa,5 Wilson Rd.,K2A3N2,1987-06-01,75545.0,1000.0,Unknown,613-555-0154
15,Burke Mandla Collins,613-555-0150,Ottawa,73 Morris Ave.,K1Y0E1,1978-07-06,147312.0,2500.0,Divorced,613-555-0150
16,Aku Ahearn,416-5550180,Toronto,46 Clay St.,M4E3N1,1962-01-24,57954.0,3000.0,Divorced,416-555-0180
17,Agostino Morgana Hashemi,867-555-0113,Yellowknife,324 Paris Hill Road,X1A1X7,1984-05-31,149273.0,3800.0,Married,867-555-0113
18,Ilija Stoyan Descoteaux,416-555-0192,Toronto,306 North Oxford Lane,M1J1Z7,1956-11-03,256360.0,4000.0,Single,416-555-0192
19,Serafim Proudfoot,902-555-0190,Charlottetown,1 Sleepy Hollow Rd.,A0C1L0,1995-09-01,65460.0,3000.0,Unknown,902-555-0190
20,Eufêmia Jamshed Baldi,4165550170,Toronto,7648 Indian Summer Street,M5E0A5,1958-02-27,155676.0,4500.0,Single,416-555-0170
21,Boris Jenson,204-555-0190,Winnipeg,69 Main Lane,R3R3B6,1983-02-17,45923.0,4500.0,Divorced,204-555-0190
22,Seosamh Gibb,902-555-0138,Charlottetown,931 Myers Ave.,C1A3W7,1991-09-09,122042.0,3500.0,Divorced,902-555-0138
23,Storm Hampton,613-555-0116,Ottawa,7437 Longfellow Lane,K2C1R1,2001-04-03,18475.0,500.0,Single,613-555-0116
24,Marlyn Mathias Sander,613-555-0165,Ottawa,35 Wayne Road,K2B8E3,1965-07-31,73759.0,3500.0,Unknown,613-555-0165
25,Bjarne Brooklynn Christophers,867-555-0158,Yellowknife,307 Railroad Street,X1A1Z2,1984-08-15,27138.0,3000.0,Married,867-555-0158
26,Jón Zak Falco,867-555-0161,Yellowknife,95 North San Juan St.,X1A3J6,1989-02-04,127768.0,1000.0,Single,867-555-0161
27,Severi Johanne Keegan,416-555-0198,Toronto,8798 Church Road,M4N2S1,1958-03-23,75039.0,3800.0,Married,416-555-0198
28,Giampaolo Stefánsson,867-555-0134,Yellowknife,98 Williams Drive,X1A2Y5,1990-10-24,145987.0,2500.0,Married,867-555-0134
29,Valéria Zuri Anthonyson,613-555-0139,Ottawa,779 E. Birch Hill Court,K2C2R3,1991-07-21,152555.0,5000.0,Unknown,613-555-0139